test/dummy/app/controllers/news/stories_controller.rb

    def seed
      20.times do |n|
        Story.create!(
          title: Faker::Lorem.sentence,
          url: Faker::Internet.url,
          points: rand(-100..100),
          image: Faker::Avatar.image,
          created_at: Faker::Time.backward(14),
        )
---
INSERT INTO "news_stories" ("title", "url", "points", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)